{
    "K8sSec": [
      {
        "id": 1,
        "title": "Securing Kubernetes Deployments",
        "details": "Our experts help you <ul><li>Deploy container workloads securely</li><li>Make sure only secured deployments are deployed</li> <li>Mitigate any deployment vulnerabilities</li>  <li>Continuously monitor and enforce container deployment security</li> </ul> Making sure your container workload secure by default",
        "image": "/K8sSec1.jpg",
        "points": {
          "headwhy": "Why Kubernetes Deployment Security Matters?" ,
          "why": "Kubernetes has been increasingly popular application hosting platform, but it's inherently risky because of its open and shared nature. <br> Kubernetes is based on contributions from multiple open source communities and there's no sole entity in charge of its security. <br> Traditional security controls like firewall doesn't work in Kubernetes ",
          "headwhen": "When To engage us?" ,
          "when": "Ideally, we want to be engaged at the early stage before your product release as it can ensure your product deployment security. <br><br> you can engage us if your cyber team raise any vulnerability about your pod deployments. <br><br> or you can engage us after any relevant security incident so we can make sure your pod deployment won't be the cause and immune from similar breach.",
          "headwho": "Who should Secure Kubernetes Deployments?" ,
          "who": "You. Anyone who is concerned about the privacy, safety, and security of your Kubernetes container workloads.",
          "headhow": "What Methodologies and Tools to Use?" ,
          "how": "In ACloud, we're Kubernetes certified specialists and have assessed over 100+ container based workload deployments so we know how to secure your deployment properly."
        }
      },
      {
        "id": 2,
        "title": "Securing Kubernetes Clusters",
        "details": "Our experts help you <ul><li>Secure Kubernetes Access</li><li>Slice Kubernetes cluster and segregate those slices properly </li> <li>Secure Ingress and Egress access</li>  <li>Secure inter-pod communication</li> </ul> Making sure your Kubernetes cluster secure and robust",
        "image": "/K8sSec2.jpg",
        "points": {
            "headwhy": "Why Kubernetes Cluster Security Matters?" ,
            "why": "Kubernetes has been increasingly popular application hosting platform, but it's inherently risky because of its open and shared nature. <br> Kubernetes is based on contributions from multiple open source communities and there's no sole entity in charge of its security. <br> Kubernetes is often used as a shared platform as KaaS (Kubernetes as a service).  <br> Traditional security controls like firewall doesn't work in Kubernetes",
            "headwhen": "When To engage us?" ,
            "when": "Ideally, we want to be engaged at the early stage before any product workloads deployment in your Kubernetes cluster as it can ensure your product environment security. <br><br> You can engage us if you find it's challenging to secure your cluster to your desire or your cyber team raises any vulnerability about your Kubernetes. <br><br> Or you can engage us after any relevant security incident so we can make sure your cluster is protected and immune from similar breaches.",
            "headwho": "Who should Secure Kubernetes Cluster?" ,
            "who": "You. Anyone who manage Kubernetes cluster or provides KaaS/CaaS (Kubernetes/Container as a service).",
            "headhow": "What Methodologies and Tools to Use?" ,
            "how": "In ACloud, we're Kubernetes certified specialists and have assessed various different flavors of Kubernetes clusters so we know how to secure your cluster properly."
        }
      },
      {
        "id": 3,
        "title": "Securing Container Images and Containers",
        "details": "Our experts help you <ul><li>Optimize Container Images</li><li>Enforce container image security </li> <li>Minimize container CVEs</li>  <li>Secure public images locally</li> </ul> Making sure your container workloads are secure",
        "image": "/K8sSec3.jpg",
        "points": {
            "headwhy": "Why Container Image and Container Security Matters?" ,
            "why": "Container images often consist of multiple layers that depends on tools/library beyond your controls. <br> Your development choices often indirectly decide its dependencies that could inherit unmitigated CVEs. <br> Multi-layer dependence and constant technology and threat landscape evolution often lead safe images to be vulnerable. <br> External dependence's on images in public or untrusted image repositories",
            "headwhen": "When To engage us?" ,
            "when": "Ideally, we want to be engaged at the early stage of your software development as it can help you choose an optimal path from the beginning. <br><br> You can engage us whenever you struggle to address your container vulnerabilities.",            
            "headwho": "Who should Secure Container Images and Containers?" ,
            "who": "You. Anyone who develop container based workloads or provides CaaS (Container as a service).",
            "headhow": "What Methodologies and Tools to Use?" ,
            "how": "In ACloud, we're Docker certified specialists and have gone through the journey to help multiple customer address the exact same challenges so we have the secret tools to assist you."
        }
      }
    ]
  }
